Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/voluntary_work_and_social_welfare_payments.html.txt.tmx
Source language: en
Languages: ga

source: Voluntary work and social welfare payments
ga: Obair dheonach agus íocaíochtaí leasa shóisialaigh

source: • Other social welfare payments
ga: • Íocaíochta Leasa Shóisialaigh Eile

source: Voluntary work is a good way to keep active, learn new skills and get involved in your local community
ga: Dóigh mhaith is ea obair dheonach le coinneáil gníomhach, scileanna nua a fhoghlaim agus le bheith páirteach i do phobal áitiúil

source: You may do some unpaid work as a volunteer and keep your social welfare payment
ga: Tá cead agat obair gan íocaíocht a dhéanamh mar shaorálaí agus d’íocaíocht leasa shóisialaigh a choinneáil

source: However, you must continue to meet all the conditions attached to your payment
ga: Beidh ort, áfach, leanúint ar aghaidh agus gach coinníoll a bhaineann le d’íocaíocht a chomhlíonadh

source: Your Intreo centre or social welfare local office or the section paying your social welfare payment will usually decide whether you can keep your social welfare payment and work as a volunteer
ga: Is é d’Oifig Leasa Shóisialaigh Áitiúil nó an rannóg a íocann d’íocaíocht leasa shóisialaigh a chinnteoidh de ghnáth go bhfuil cead agat d’íocaíocht leasa shóisialaigh a choinneáil agus oibriú mar shaorálaí

source: Usually, you get a disability payment because you cannot work
ga: De ghnáth, faigheann tú íocaíocht míchumais cionn is nach féidir leat oibriú

source: If you are getting Disability Allowance, Illness Benefit or Invalidity Pension you must get permission to work as a volunteer
ga: Má tá tú ag fáil Liúntas Míchumais, Sochar Breoiteachta nó Pinsean Easláinte, ní mór duit cead a fháil le hoibriú mar shaorálaí

source: You must apply to the section that pays your social welfare payment before starting any voluntary work
ga: Ní mór duit cur isteach ar an rannóg a íocann d’íocaíocht leasa shóisialaighsula dtosaíonn tú ar obair dheonach ar bith

source: You can work as a volunteer while you are getting Invalidity Pension or Illness Benefit and it is not necessary to apply for the Partial Capacity Scheme
ga: Tá cead agat obair dheonach a dhéanamh má tá tú ag fáil Sochar Breoiteachta nó Pinsean Easláinte agus ní gá duit iarratas a dhéanamh ar Shochar Cumais Pháirtigh

source: If you are getting Invalidity Pension you cannot do more than 19.5 hours of voluntary work per week
ga: Má tá tú ag fáil Pinsean Easláinte níl cead agat níos mó ná 19.5 uair d’obair dheonach a dhéanamh sa tseachtain

source: If you are getting Illness Benefit or Disability Allowance, there is no limit on the number of hours per week you can work unpaid as a volunteer
ga: Má tá tú ag fáil Sochar Breoiteachta nó Liúntas Míchumais, níl aon teorainn ar líon na n-uaireanta sa tseachtain a bhfuil cead agat oibriú gan íocaíocht mar shaorálaí

source: To qualify for a carer’s payment you must be providing full-time care
ga: Le bheith incháilithe le haghaidh íocaíocht cúramóra ní mór duit a bheith ag soláthar cúraim lánaimseartha

source: If you are getting Carer’s Allowance or Carer’s Benefit, you can do a maximum of 15 hours per week of voluntary work
ga: Má tá tú ag fáil Liúntas Cúramóra nó Sochar Cúramóra, tá cead agat uasmhéid de 15 uair sa tseachtain d’obair dheonach a dhéanamh

source: Before you start working as a volunteer, you must get permission from the Carer’s Allowance or Carer’s Benefit section in the Department of Social Protection
ga: Sula dtosaíonn tú ag obair mar shaorálaí, ní mór duit cead a fháil ó rannóg an Liúntais Chúramóra nó an tSochair Chúramóra sa Roinn Coimirce Sóisialaí

source: To get Jobseeker's Allowance or Jobseeker's Benefit you must be available and looking for work
ga: Caithfidh tú a bheith ar fáil agus ag lorg oibre chun Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist a fháil

source: If you want to do voluntary work, you must first get permission from a Deciding Officer at your Intreo centre or social welfare local office
ga: Más mian leat obair dheonach a dhéanamh, ní mór duit cead a fháil ar dtús ón d’Oifigeach Breithiúnachta ag d’Oifig Leasa Shóisialaigh Áitiúil

source: You must continue to satisfy the conditions of your jobseeker’s payment
ga: Ní mór duit leanúint de choinníollacha d’íocaíocht cuardaitheora poist a shásamh

source: A number of factors are taken into account by a Deciding Officer in determining whether the work involved is voluntary, these include:
ga: Glacann Oifigeach Breithiúnachta roinnt fachtóirí san áireamh agus cinneadh á dhéanamh go bhfuil an obair atá i gceist deonach, áirítear leo siúd:

source: • The aims and standing of the voluntary organisation (they can be national or local voluntary groups)
ga: • Aidhmeanna agus seasamh na heagraíochta deonaí (is féidir leo a bheith ina ngrúpaí náisiúnacha agus deonacha áitiúla)

source: • The type of work involved
ga: • An cineál oibre atá i gceist

source: • The weekly number of hours worked
ga: • Líon na n-uaireanta a oibrítear gach seachtain

source: Examples of unpaid voluntary work a jobseeker may do include assisting youth clubs, care groups, sports groups, and local residents associations
ga: Áirítear le samplaí den obair dheonach a bhféadfadh le cuardaitheoir poist a dhéanamh cuidiú le clubanna óige, grúpaí cúraim, grúpaí spóirt, agus cumainn chónaitheoirí áitiúla

source: If you want to do voluntary work and continue to get Jobseeker’s Allowance or Jobseeker’s Benefit, you must apply under the voluntary work option before you start any voluntary work
ga: Dá mba mhian leat obair dheonach a dhéanamh agus leanúint den Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist a fháil, ní mór duit iarratas a dhéanamh faoi réir rogha na hoibre deonaí sula dtosaíonn tú ar obair dheonach ar bith

source: To apply, fill in application form (VW1), which is available from your Intreo centre or social welfare local office
ga: Chun iarratas a dhéanamh, comhlánaigh foirm iarratais (VW1), atá ar fáil ó d’Oifig Leasa Shóisialaigh Áitiúil

source: Other social welfare payments
ga: Íocaíochta Leasa Shóisialaigh Eile

source: If you are getting one of the payments listed below, there are no restrictions on the number of hours or type of unpaid work you may do
ga: Má tá tú ag fáil ceann de na híocaíochtaí atá liostaithe thíos, níl aon bhac ar líon na n-uaireanta nó ar chineál na oibre gan íocaíocht a bhfuil cead agat a dhéanamh

source: In addition, you don’t need prior permission to do voluntary work
ga: Ar a bharr sin, níl réamhchead ag teastáil uait chun obair dheonach a dhéanamh
